Merge pull request #1 from abhinavtiwari77/main
docs: update deployment and architecture guide
